Revit 2027 API
DirectShapeType.IsValidShape Method
Overload List
Name | Description
IsValidShape(ExternallyTaggedGeometryObject) |  Validates shape to be stored in a DirectShapeType.
IsValidShape(IList<GeometryObject>) |  Validates shape to be stored in a DirectShapeType.
IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Validates view-specific shape to be stored in a DirectShapeType. Expects a non-default view type.
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace